cfd/parent_cases/standard/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 6e-05;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    wing_baffle
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 6e-05;
        value           uniform 6e-05;
    }
    tunnel
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 6e-05;
    }
    wing
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
